Revit 2027 API
IFCOpeningData.GetExtrusionData Method
 Gets extrusion data.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<IFCExtrusionData> GetExtrusionData()
Public Function GetExtrusionData As IList(Of IFCExtrusionData)
public:
IList<IFCExtrusionData^>^ GetExtrusionData()
member GetExtrusionData : unit -> IList<IFCExtrusionData>
Return Value
IList<IFCExtrusionData>
 The extrusion data.
See Also
Reference
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace